[
  {
    "path": "posts/2021-06-15-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Jiayi Wang",
        "url": "https://www.linkedin.com/in/jiayi-wang-smu/"
      }
    ],
    "date": "2021-06-15",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Introduction\r\n2. Critique and suggestion\r\n3 Alternative Graphical Representation\r\n4 Data preparation\r\n5 visualize data by Tableau5.1 Build Circle Plot\r\n5.2 Build Line Plot\r\n5.3 Build Box Plot\r\n5.4 Build Dash Board\r\n\r\n6 Final Dashboard\r\n7 Insights\r\n\r\n1. Introduction\r\n\r\nThis post is downloaded from Singapore Statistics Official Website, which is created by using data provided by Department of Statistics, Singapore (DOS). This visualization shows different countries’ merchandise trade with Singapore. The data are available under the sub-section of Merchandise Trade by Region.\r\nHowever, this post was not well organized. There are several problems with this data visualization. In the following passage, I will explain the aspects where the post could improve and show how I can visualize this data.\r\n2. Critique and suggestion\r\nWe were exposing that the correct type of presentation is essential in clarifying the information we need to convey. A good idea should guide the reader to the right conclusion as intended by the author. In addition, visual impairment is an essential role for the speaker and four to a joyful, positive experience concerning vision. It can be in the proper form and location, as well as reducing/eliminating dangerous “junk”.\r\n\r\nAlthough the original animation post is easy to show circles when users hover mouse to them, it becomes hard to read when we turn this post into a still image.\r\nCLARITY\r\nTAG. The tag of each country makes this post look pretty messy. A part of tags display in an empty area; however, the others are put over the circle. Those tags, which are above rings, make the post difficult to read.\r\nVALUE. This post only shows the sum of import and export value in 2020. The original data also provide the data for each month. Thus, this post does not make good use of the time series of original data, telling the trend of import & export value. And we even could use those trends to predict the following year.\r\nCIRCLE. All the circles are too large to present clearly. Many countries like Malaysia, the EU, Korea are blocked by other countries like the United States and Japan.\r\n\r\nBEAUTY\r\nREMEMBER. I have to admit that the original post looks quite beautiful. And it is far more beautiful. A too colorful graph might make readers tough to remember the result and what each color stands for.\r\nBACKGROUND. It unnecessary to make the background has color.\r\n\r\n3 Alternative Graphical Representation\r\nFollowing pic shows the alternative graphical representation proposed for the makeover. Besides improving the original post, I will also take a new graph into the post, showing the time series of different partners with their merchandise trade. After joining them to the dashboard, I believe the new post will make good use of the original data. \r\n4 Data preparation\r\nAfter downloading the data set(in .xlsx format) from the official site. I opened it with Microsoft excel software. This file has 3 sheet pages, Content Page, Import Page, Export Page. Take a look at Import Data and Export Data. There are some irrelevant columns(columns 1~5 & columns after 127). So after selected them and deleted those columns, I saved it as a new file.\r\n\r\n\r\nThis time, instead of using Excel to manipulate cleanning process, I will use Tableau Prep to clean and extract data.\r\n\r\nThe whole Prep process would look like the following picture. \r\nFirst, open Tableau Prep and import the new file which I have processed in Excel. Drag T1 and T2 from the sidebar and put them in the main window. If you have to look at the original file, you would know many columns we don’t need. Thus, I need to create a few clean steps to remove them. And this process will speed up following process steps as well.  Select all the columns except the year of 2020 and right click-remove them. I only want data which between 01-01-2020 and 12-01-2020.  In the column, which contains the country value, click the side icon and choose “Filter”-“Selected Values.” I choose 10 countries, the same countries as the original post.\r\n Then, I use Pivot function to make the date value into a single column. Select all the “2020” values and drag to the middle window.\r\n Check the Pivot result, change the columns to appropriate names, and type. Do the same thing to another table T2(copy clean step and pivot, paste, and link to T2).\r\nBe noticed: T1-Trade Import/T2-Trade Export\r\nNow your data should look like the following picture.  Great! It’s time to join T1 and T2 together. Drag one of the pivot values and put it to the right side of another pivot value. In the settings, I match Country and Date. Noticed there are duplicate columns in the table, I removed those columns as well.  Be cautious, if you take a close look at countries, you will notice that the European Union is in (Million Dollars). I create a new clean step and add new calculate fields to correct Import & Export values. Then, I delete the original wrong data. \r\nIF CONTAINS([Country],'Million')\r\nTHEN [Import]*1000\r\nELSE [Import]\r\nEND\r\n\r\nPleases correct “Country” column after changing value by Split function. Finally, add Output at the end of flow. Change file setting and check data before clicking “Run Flow”. And you will get the cleaned data!\r\n\r\n5 visualize data by Tableau\r\n5.1 Build Circle Plot\r\nThe first target is to build a circle plot. This graph will present different countries’ trade performance with Singapore, like how much they trade and which kind of trade has a higher percentage in total merchandise trade. Create 2 calculate fields to get the total merchandise trade performance and whether Import is greater than Export.\r\nHigher Value\r\nIF SUM([Export])>SUM([Import])\r\nTHEN 'Export More'\r\nELSEIF SUM([Export])<SUM([Import])\r\nTHEN 'Import More'\r\nELSE 'Equal'\r\nEND\r\nSumIE\r\nSUM([Export])+SUM([Import])\r\nAfter getting those two values, I can drag and drop Import and Export to x, y-axis separately. And put Country in Detail to differentiate each country.\r\n\r\nNext, I place the SumIE, which I calculated in Size, and place Higher Value in Color.  In order to let readers differentiate different types conveniently, I will add a diagonal line to separate the table to be two parts. The countries in the circles which belong to the above part are more likely to export their goods to Singapore. This also means Singapore will import much more goods from them than export goods to them. The countries in the circles that belong to the beneath part buy Singapore goods more than export goods to Singapore. To create this diagonal line, I put Import to columns. Then I remove the Size and color from Import Marks.\r\n After making the Size smaller and change the color, I Dual Axis Import and make the 2 tables become 1. Finally, we could add a Trend Line to those transparent plots. You also could remove Tooltip from Trend Line to make it much more beautiful. \r\nIt suddenly hit me that I could get more information from this graph if I use the Filters function. So I put Time into Filters and make it visible. You also need to change the Time in the Filter into Month-Discrete. After you do this, you can change the filter type to Single Value (Slider). \r\n\r\nUsing Animations from Format will make the change quite frequent.\r\n\r\n\r\nLast but not least, make some changes in:\r\nFilter Name\r\nTable Title\r\nSynchronize Axis\r\nCircle Size\r\nTo make the post clearer.\r\nWell done~ Now, your chart should look like the following picture.\r\n\r\n5.2 Build Line Plot\r\nIn this part, we will create a line graph to observe the volatility of Import and Export values of different countries in 2020. Please create a new sheet and bring Import and Export value into rows, make them into a dual axis. In the columns, put Time-month.  Now, this post shows all countries’ Import and Export in 2020. Take Time into Filters and make it visible. Then I can display different counties separately by changing the filter.  Remember to change your title. Your post should look like the following graph. \r\n5.3 Build Box Plot\r\nIn order to have a clearer understanding of the overview, I decided to create a box plot to show the result. I use the in-build function to do this. Create a new sheet and choose box plot from “Show me”.\r\n\r\n5.4 Build Dash Board\r\nTo put the above 3 posts together, I build a dashboard to gather them together. You can see this from the following picture.\r\n\r\n6 Final Dashboard\r\n\r\nLink to Tableau Public\r\n\r\n\r\n7 Insights\r\nFrom the box plot, we could draw a conclusion that Singapore’s biggest merchandise trade partner is Mainland China. China is one of the essential merchandise countries in the world. And Singapore has a good trade relationship with China. It is relatively steady of Singapore’s import volume from China. However, the export amount fluctuates significantly over 2020.\r\n\r\nFrom the line graph, it is apparently that Singapore is gradually increasing the export volume to China from July. That’s the reason why the export value fluctuated a lot in 2020. In the meantime, Hong Kong and Taiwan’s performances are pretty interesting. Exports dominate Singapore’s trade with Hong Kong. On the other side, imports dominate Singapore’s trade with Taiwan. They compensate each other for transaction volume and keep a healthy increase.\r\n\r\nThe circle plot could show the distribution of different countries’ trade amounts clearly. If you click the circle or change the filter’s time, it will show each country’s dominant trade type according to the time. Since Japan and Korea locate next to each other and they have the relatively same size. Let’s take a look at them. Japan mainly could be found above the diagonal line, but Korea mostly stays below the line. Besides that, their paths are pretty stable. It shows that theirs trade performances are quite similar, just opposite trade kinds. Singapore import from Japan more and export to Korea more. We could treat them as the same country pattern.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-19T21:57:46+08:00",
    "input_file": "dataviz-makeover-2.utf8.md"
  },
  {
    "path": "posts/2021-05-22-dateviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "Refine of \"Merchandise Trade of Top Six Trading Countries,2019-2020\"",
    "author": [
      {
        "name": "Jiayi Wang",
        "url": "https://www.linkedin.com/in/jiayi-wang-smu/"
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Introduction\r\n2. Critique and suggestion\r\n3 Alternative Graphical Representation\r\n4 Data preparation\r\n5 visualize data by Tableau5.1 Process date column\r\n5.2 Process Import & Export columns\r\n5.3 Visualize date in worksheet\r\n\r\n6 Final Dashboard\r\n7 Insights\r\n\r\n1. Introduction\r\n This post is part of the submission for ISSS608 DataViz Makeover assignment 1.This data visualisation is created by using data provided by Department of Statistics, Singapore (DOS). The data are available under the sub-section of Merchandise Trade by Region/Market.\r\nHowever, this post was not well organized. There are several problems with this data visualization. In the following passage, I will explain the aspects where the post could improve and show how I can visualize this data.\r\n2. Critique and suggestion\r\nWe were exposing that the correct type of presentation is essential in clarifying the information we need to convey. A good idea should guide the reader to the right conclusion as intended by the author. In addition, visual impairment is an essential role for the speaker and four to a joyful, positive experience concerning vision. It can be in the proper form and location, as well as reducing/eliminating dangerous “junk”.\r\n It’s important for the post to be both clear and beautiful. However, the above post does not satisfied with those requirements.\r\nCLARITY\r\nThe Time Period is not consistent. Some countries are from 2019 to 2021, and some countries just show the year around 2020.\r\nThe x-axis does not have enough scale. Readers could not tell which part is exactly the year, for example, 2019. It’s not clear.\r\nThe y-axis of Import and y-axis of Export’s unit of measurement are different. This will mislead readers to the wrong observations.\r\nUsing area to display leads to the chart quite a mess. Readers could not observe results directly.\r\n\r\nBEAUTY\r\nThe post ranks countries randomly. It’s not beautiful.\r\nThe length of six counties’ x-axis is not consistent.\r\n\r\n3 Alternative Graphical Representation\r\nFollowing pic shows the alternative graphical representation proposed for the makeover.\r\n\r\nAccording to the original post of the visualization, the author intends to compare the six countries’ import and export relationship between 2019 and 2020.\r\nSo, I will correct the mistakes in the original post and choose line chart to visualize the data.\r\n4 Data preparation\r\nAfter downloading the data set(in .xlsx format) from the official site. I opened it with Microsoft excel software. This file has 3 sheet pages, Content Page, Import Page, Export Page. Take a look at Import Data and Export Data. There are some irrelevant columns(column 1~5 & columns after 127). So I selected them and deleted. \r\nThen I noticed that the date of Import Data is arranged horizontal. So I copied it and created a new sheet to paste with transform function.  Since I only analysis the year from Jan 2019 to Dec 2020, I selected all time rows except the year between 2019 and 2020, and delete them.  Now your data table should look like this.  Good! The next step is to select all the countries except 6 countries in red color(America, Malaysia, Japan, HongKong, Taiwan, and Mainland China) and delete those countries as well. p.s. I use red color just to make it easier to distinguish, which means you don’t have to do this.  now your data table should look like this.  I noticed that the unit of measurement of these counties are different. Except America, other countries are count in “Thousand Dollar”. So I calculated them in same format. You can use function to calculate and replace the original data.  you date should look like this.  Then, I duplicated the variable(time) column, stacked all countries data and added a new “country” column. After processing, the data should look like the following image’s format.  I did the same thing to the “T2” table(Export Data).  OK, finally I created a new sheet(Name:Total) and brought them(Import and Export data) together into the “Total”. Be noticed: match data with right countries  Save the processed data.\r\n5 visualize data by Tableau\r\n5.1 Process date column\r\nDrag and import processed to Tableau. Noticed that I could not simply change “Time” column from character(string) type to date type. So I right click “Time column and choose”split\" function.  After split time column you will get 2 new column, “Time - Split 1” shows the year, “Time - Split 2” shows the month. “Time - Split 1” is in number format, however, “Time - Split 2” is in character format which could not be simply changed to number format as well. So again, I right clicked “Time - Split 2” column and created a new calculate field.  I used the following codes to change the month value into number format.\r\nIF [Time - Split 2] ==\"Jan\"\r\n    then 1\r\nELSEIF [Time - Split 2]==\"Feb\"\r\n    then 2\r\nELSEIF [Time - Split 2]==\"Mar\"\r\n    then 3\r\nELSEIF [Time - Split 2]==\"Apr\"\r\n    then 4\r\nELSEIF [Time - Split 2]==\"May\"\r\n    then 5\r\nELSEIF [Time - Split 2]==\"Jun\"\r\n    then 6\r\nELSEIF [Time - Split 2]==\"Jul\"\r\n    then 7\r\nELSEIF [Time - Split 2]==\"Aug\"\r\n    then 8\r\nELSEIF [Time - Split 2]==\"Sep\"\r\n    then 9\r\nELSEIF [Time - Split 2]==\"Oct\"\r\n    then 10\r\nELSEIF [Time - Split 2]==\"Nov\"\r\n    then 11\r\nELSEIF [Time - Split 2]==\"Dec\"\r\n    then 12\r\nELSE\r\n    0\r\nEND\r\n Now I get 2 numeric column of year and month. What I need to do is trying to combine them together with calculate function, Right click any column and create a new calculate field(here I name it “Date”) and use following codes to join month and year.\r\nMAKEDATE([Time - Split 1],[Calculation1],1)\r\n\r\n5.2 Process Import & Export columns\r\nCurrently, the import and export column was in character type. So, change Import & Export columns to “Number(decimal)” by right click the type icon on the left up corner. \r\n5.3 Visualize date in worksheet\r\nCreate a new worksheet. Drag Export & Import columns into rows and change them into continuous and measure by “Sum”.  Drag Date column twice into Columns and change one of them into month in continuous type.  Then you need to create two parameter value to separate countries horizontally. It could help chart much more clear and beautiful. \r\nColumn:\r\n(INDEX()-1)%ROUND(SQRT(SIZE()))\r\nRow:\r\nINT((INDEX()-1)/ROUND(SQRT(SIZE())))\r\n Drag 2 Calculate field in Columns and Rows separately. Input Country value into “Detail”.  Then change the value in “compute using” to “Country”  Now your chart should lool like following pic.  Do like the next two images, drag Export column to the right side of the chart and let chart to be dual axis.  Right click right side y-axis, choose “Synchronize dual axes” in “Edit axis…”.  Right click Country in “Detail” and choose “sort” from “Marks-All”.  Sort By “Field”. Sort Order “Descending”. Field Name “Import”. Aggregation “Sum”.  Right click two side headers and cancel them. This will chart clearer.  Change “Tooltip” and let it much clearer.\r\nMonth of Date:  <MONTH(Date)>\r\nCountry:<Country>\r\nSum of Import(million): <SUM(Import(million))>\r\nSum of Export(Million): <SUM(Export(Million))>\r\nFinally, add “Annotate” to show countries and change sheet name. Let readers much easier to observe the result. \r\n6 Final Dashboard\r\nLink to Tableau Public \r\n7 Insights\r\nChina has the highest import amount among six countries even larger than US. And China’s trade amount is keep climbing with fluctuations. Although US’s import amount ranking second place, its import amount is gradually going down under current trend.\r\nThe import values of China, US, Malaysia and Japan are quite close to those countries ‘s export values. Those countries’ trades are balanced. However, Taiwan and Hong Kong’s export value are relatively larger than their import value, which shows Taiwan and Hong Kong mostly do export trades.\r\nChina’s export amount(including Taiwan and Hong Kong) are gradually going high. It might be facing overcapacity problems. This also show the economic condition in China goes well. This trade trend might influence the Currency Exchange Rate in the furture.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-18T22:11:08+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Jiayi's World",
    "description": "Welcome to Jiayi's blog. Let's try something interesting!",
    "author": [
      {
        "name": "Jiayi Wang",
        "url": "https://www.linkedin.com/in/jiayi-wang-smu/"
      }
    ],
    "date": "2021-05-21",
    "categories": [],
    "contents": "\r\n/library(distill)create_post(“The Sharpe Ratio”)/\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-15T21:52:00+08:00",
    "input_file": {}
  }
]
