[
  {
    "path": "posts/2021-05-22-dateviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "Refine of \"Merchandise Trade of Top Six Trading Countries,2019-2020\"",
    "author": [
      {
        "name": "Jiayi Wang",
        "url": "https://www.linkedin.com/in/jiayi-wang-smu/"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\n1. Introduction\r\n This post is part of the submission for ISSS608 DataViz Makeover assignment 1.This data visualisation is created by using data provided by Department of Statistics, Singapore (DOS). The data are available under the sub-section of Merchandise Trade by Region/Market.\r\nHowever, this post was not well organized. There are several problems with this data visualization. In the following passage, I will explain the aspects where the post could improve and show how I can visualize this data.\r\n2. Critique and suggestion\r\nWe were exposing that the correct type of presentation is essential in clarifying the information we need to convey. A good idea should guide the reader to the right conclusion as intended by the author. In addition, visual impairment is an essential role for the speaker and four to a joyful, positive experience concerning vision. It can be in the proper form and location, as well as reducing/eliminating dangerous “junk”.\r\n It’s important for the post to be both clear and beautiful. However, the above post does not satisfied with those requirements.\r\nCLARITY\r\nThe Time Period is not consistent. Some countries are from 2019 to 2021, and some countries just show the year around 2020.\r\nThe x-axis does not have enough scale. Readers could not tell which part is exactly the year, for example, 2019. It’s not clear.\r\nThe y-axis of Import and y-axis of Export’s unit of measurement are different. This will mislead readers to the wrong observations.\r\nUsing area to display leads to the chart quite a mess. Readers could not observe results directly.\r\n\r\nBEAUTY\r\nThe post ranks countries randomly. It’s not beautiful.\r\nThe length of six counties’ x-axis is not consistent.\r\n\r\n3 Alternative Graphical Representation\r\nFollowing pic shows the alternative graphical representation proposed for the makeover.\r\n\r\nAccording to the original post of the visualization, the author intends to compare the six countries’ import and export relationship between 2019 and 2020.\r\nSo, I will correct the mistakes in the original post and choose line chart to visualize the data.\r\n4 Data preparation\r\nAfter downloading the data set(in .xlsx format) from the official site. I opened it with Microsoft excel software. This file has 3 sheet pages, Content Page, Import Page, Export Page. Take a look at Import Data and Export Data. There are some irrelevant columns(column 1~5 & columns after 127). So I selected them and deleted. \r\nThen I noticed that the date of Import Data is arranged horizontal. So I copied it and created a new sheet to paste with transform function.  Since I only analysis the year from Jan 2019 to Dec 2020, I selected all time rows except the year between 2019 and 2020, and delete them.  Now your data table should look like this.  Good! The next step is to select all the countries except 6 countries in red color(America, Malaysia, Japan, HongKong, Taiwan, and Mainland China) and delete those countries as well. p.s. I use red color just to make it easier to distinguish, which means you don’t have to do this.  now your data table should look like this.  I noticed that the unit of measurement of these counties are different. Except America, other countries are count in “Thousand Dollar”. So I calculated them in same format. You can use function to calculate and replace the original data.  you date should look like this.  Then, I duplicated the variable(time) column, stacked all countries data and added a new “country” column. After processing, the data should look like the following image’s format.  I did the same thing to the “T2” table(Export Data).  OK, finally I created a new sheet(Name:Total) and brought them(Import and Export data) together into the “Total”. Be noticed: match data with right countries  Save the processed data.\r\n5 visualize data by Tableau\r\n5.1 Process date column\r\nDrag and import processed to Tableau. Noticed that I could not simply change “Time” column from character(string) type to date type. So I right click “Time column and choose”split\" function.  After split time column you will get 2 new column, “Time - Split 1” shows the year, “Time - Split 2” shows the month. “Time - Split 1” is in number format, however, “Time - Split 2” is in character format which could not be simply changed to number format as well. So again, I right clicked “Time - Split 2” column and created a new calculate field.  I used the following codes to change the month value into number format.\r\nIF [Time - Split 2] ==\"Jan\"\r\n    then 1\r\nELSEIF [Time - Split 2]==\"Feb\"\r\n    then 2\r\nELSEIF [Time - Split 2]==\"Mar\"\r\n    then 3\r\nELSEIF [Time - Split 2]==\"Apr\"\r\n    then 4\r\nELSEIF [Time - Split 2]==\"May\"\r\n    then 5\r\nELSEIF [Time - Split 2]==\"Jun\"\r\n    then 6\r\nELSEIF [Time - Split 2]==\"Jul\"\r\n    then 7\r\nELSEIF [Time - Split 2]==\"Aug\"\r\n    then 8\r\nELSEIF [Time - Split 2]==\"Sep\"\r\n    then 9\r\nELSEIF [Time - Split 2]==\"Oct\"\r\n    then 10\r\nELSEIF [Time - Split 2]==\"Nov\"\r\n    then 11\r\nELSEIF [Time - Split 2]==\"Dec\"\r\n    then 12\r\nELSE\r\n    0\r\nEND\r\n Now I get 2 numeric column of year and month. What I need to do is trying to combine them together with calculate function, Right click any column and create a new calculate field(here I name it “Date”) and use following codes to join month and year.\r\nMAKEDATE([Time - Split 1],[Calculation1],1)\r\n\r\n5.2 Process Import & Export columns\r\nCurrently, the import and export column was in character type. So, change Import & Export columns to “Number(decimal)” by right click the type icon on the left up corner. \r\n5.3 Visualize date in worksheet\r\nCreate a new worksheet. Drag Export & Import columns into rows and change them into continuous and measure by “Sum”.  Drag Date column twice into Columns and change one of them into month in continuous type.  Then you need to create two parameter value to separate countries horizontally. It could help chart much more clear and beautiful. \r\nColumn:\r\n(INDEX()-1)%ROUND(SQRT(SIZE()))\r\nRow:\r\nINT((INDEX()-1)/ROUND(SQRT(SIZE())))\r\n Drag 2 Calculate field in Columns and Rows separately. Input Country value into “Detail”.  Then change the value in “compute using” to “Country”  Now your chart should lool like following pic.  Do like the next two images, drag Export column to the right side of the chart and let chart to be dual axis.  Right click right side y-axis, choose “Synchronize dual axes” in “Edit axis…”.  Right click Country in “Detail” and choose “sort” from “Marks-All”.  Sort By “Field”. Sort Order “Descending”. Field Name “Import”. Aggregation “Sum”.  Right click two side headers and cancel them. This will chart clearer.  Change “Tooltip” and let it much clearer.\r\nMonth of Date:  <MONTH(Date)>\r\nCountry:<Country>\r\nSum of Import(million): <SUM(Import(million))>\r\nSum of Export(Million): <SUM(Export(Million))>\r\nFinally, add “Annotate” to show countries and change sheet name. Let readers much easier to observe the result. \r\n6 Final Dashboard\r\nLink to Tableau Public \r\n7 Insights\r\nChina has the highest import amount among six countries even larger than US. And China’s trade amount is keep climbing with fluctuations. Although US’s import amount ranking second place, its import amount is gradually going down under current trend.\r\nThe import values of China, US, Malaysia and Japan are quite close to those countries ‘s export values. Those countries’ trades are balanced. However, Taiwan and Hong Kong’s export value are relatively larger than their import value, which shows Taiwan and Hong Kong mostly do export trades.\r\nChina’s export amount(including Taiwan and Hong Kong) are gradually going high. It might be facing overcapacity problems. This also show the economic condition in China goes well. This trade trend might influence the Currency Exchange Rate in the furture.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T21:03:48+08:00",
    "input_file": "dateviz-makeover-1.utf8.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Jiayi's World",
    "description": "Welcome to Jiayi's blog. Let's try something interesting!",
    "author": [
      {
        "name": "Jiayi Wang",
        "url": "https://www.linkedin.com/in/jiayi-wang-smu/"
      }
    ],
    "date": "2021-05-21",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-22T15:18:19+08:00",
    "input_file": {}
  }
]
